{
  "chewing": [
    "Provide positive reinforcement and heap on praise when you see your dog chewing acceptable items.",
    "Ensure your dog has easy access to chew toys so they have an acceptable alternative to your shoe or couch.",
    "Remove attractive items that you can to keep temptation at bay.",
    "Do not punish your dog when you see them chewing something unacceptable - redirect their attention to an appropriate item for chewing.",
    "If redirection and access to chew toys is not working you can try a taste deterrent like a pet-safe, fabric-safe spray available at many pet stores.",
    "As with any destructive behavior, a dog may be expressing boredom or frustration. Ensure your dog has mentally stimulating activities like puzzles, playdates or agility training and plenty of physical exercise."
  ],

  "jumping": [
    "Remember that attention is a form of reward for your dog. Ask visitors to ignore your dog when they are jumping to avoid reinforcing the behavior.",
    "Master the sit command with your dog and use it when you do not want them to jump. Reward 'sit' with a high-value treat."
  ],

  "barking": [
    "Keep in mind your attention is a form of reward for your dog so it is best to ignore attention-seeking barking so as not to reinforce the behavior.",
    "Teach your dog a 'quiet' command; give a reward when your dog stops barking after you say 'quiet' or a similar word.",
    "Avoid yelling at the dog - this tends to make barking worse.",
    "Reward your dog when they are quiet and calm.",
    "Try using a strong stimulus like clapping your hands to redirect your dog's attention."
  ],

  "puppy": [
    "The earlier you start training the better; take advantage of their prime learning time.",
    "Keep training sessions short and frequent to maximize learning potential and to not overwhelm your puppy.",
    "Heap on rewards like treats and praise when your puppy does desired behaviors.",
    "Start socialization as early as possible to get your pup comfortable with new people, environments and other dogs.",
    "Start with very basic obedience like 'sit,' 'stay,' and 'come' before moving on to tricks or more complicated commands.",
    "Introduce your puppy to leashes, collars and harnesses early - let them sniff the items first then wear them for short periods while playing or being given treats."
  ],

  "potty training": [
    "Use a designated potty area to provide environmental cues.",
    "Establish an appropriate schedule with frequent, regular potty trips to establish routine and prevent accidents.",
    "Reward dog when they successfully potty in an appropriate location."
  ],

  "leash training": [
    "Stop walking if your dog is pulling on the leash.",
    "Keep a stash of treats on you to motivate your dog to stay beside you on walks.",
    "Start in an environment where there are few to no distractions to set your dog up for success.",
    "As your dog has success in a low-distraction environment slowly add in exposure to distractions such as other dogs or people and continue to positively reinforce good behavior on the leash."
  ],

  "crate training": [
    "Never use the crate as a form of punishment; it is possible and desirable for your dog to have a pawsitive association with the crate.",
    "Start with very short periods of time in the crate and gradually increase the amount of time as your dog becomes more comfortable.",
    "Make the crate comfortable and safe so your dog builds positive associations with it."
  ],

  "general": [
    "Minimise distrations; maintain a quiet environment without other humans and animals present while training.",
    "End training sessions with something your dog already knows to end on a pawsitive note.",
    "Don't try to do everything all at once; break up training into brief, regular sessions to avoid overwhelming you or your dog.",
    "Just like humans dogs will take different amounts of time to learn something new - be patient they'll get it eventually!",
    "Avoid punishment - only use rewards to reinforce desired behavior.",
    "Keep commands simple - ideally one word or a simple hand signal will do.",
    "Figure out what your dog likes best so you have a desirable reward - treats, praise and toys are good places to start.",
    "Keep things light and fun. You will have greater success if both you and your dog are enjoying the training session and deepening your bond.",
    "Be consistent. Stick with the same commands and techniques to give your dog a chance to learn routines.",
    "Pay attention to your dog's behavior. If they avoid eye contact or have a stiff posture they could be experiencing stress and it's best to take a break."
  ]
}
